---
kind: property
id: P:Autodesk.Revit.DB.HermiteFace.Tangents(System.Int32)
source: html/df058f6e-b581-14a5-714b-7ab48613d0c0.htm
---
# Autodesk.Revit.DB.HermiteFace.Tangents Property

Tangents of the surface.

## Syntax (C#)
```csharp
public IList<XYZ> this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)